CanRotate Property
 Property to test whether the family instance can be rotated by 180 degrees.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool CanRotate { get; }
  Visual Basic
Public ReadOnly Property CanRotate As Boolean
	Get
  Visual C++
public:
property bool CanRotate {
	bool get ();
}
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →